In [37]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [39]:
data = {"Country":["Belgium","India","Brazil"],"Capital":["Brussels","New Delhi","Brasilia"],"Population":[11190846,1303171035,207847528]}

### Series

In [7]:
s1 = pd.Series(data["Country"],index = ["q","w","e"])
s1

q    Belgium
w      India
e     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [6]:
s1.index

RangeIndex(start=0, stop=3, step=1)

### DataFrame

In [40]:
df1 = pd.DataFrame(data)
print(df1.shape)
df1

(3, 3)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [10]:
cou = df1["Country"]
type(cou)

pandas.core.series.Series

In [17]:
print(type(df1.iterrows()))
df1.iterrows()  #

<class 'generator'>

In [14]:
for row in df1.iterrows():
    print(type(row),len(row))
    print(row)

<class 'tuple'> 2
(0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
<class 'tuple'> 2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'> 2
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)

In [15]:
for row in df1.iterrows():
    print(type(row[0]),row[0])
    print(type(row[1]),row[1])
    break

<class 'int'> 0
<class 'pandas.core.series.Series'> Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [18]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [23]:
s1 = pd.Series(data["Capital"])
s2 = pd.Series(data["Country"])
s3 = pd.Series(data["Population"])

In [24]:
s1

0     Brussels
1    New Delhi
2     Brasilia
dtype: object

In [27]:
df_new = pd.DataFrame([s1,s2,s3])
df_new

          0           1          2
0  Brussels   New Delhi   Brasilia
1   Belgium       India     Brazil
2  11190846  1303171035  207847528

In [28]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [31]:
df_new = df_new.T
df_new

           0        1           2
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [32]:
df_new1 = pd.DataFrame([s1,s2,s3],index = ["Capital","Country",'Population'])
df_new1

                   0           1          2
Capital     Brussels   New Delhi   Brasilia
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528

In [36]:
df_new1 = df_new1.T
df_new1

                   0           1          2
Capital     Brussels   New Delhi   Brasilia
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528